"use client";

export default function Section08Order() {
  return (
    <>
      <p className="text-[#fffffe] leading-relaxed">
        Безопасность персональных данных, которые обрабатываются Оператором,
        обеспечивается путем реализации правовых, организационных и технических
        мер, необходимых для выполнения в полном объеме требований действующего
        законодательства в области защиты персональных данных.
      </p>
      <ul className="list-disc pl-5 text-[#fffffe] space-y-2">
        <li>
          <strong>8.1.</strong> Оператор обеспечивает сохранность персональных
          данных и принимает все возможные меры, исключающие доступ к
          персональным данным неуполномоченных лиц.
        </li>
        <li>
          <strong>8.2.</strong> Персональные данные Пользователя никогда, ни при
          каких условиях не будут переданы третьим лицам, за исключением
          случаев, связанных с исполнением действующего законодательства либо в
          случае, если субъектом персональных данных дано согласие Оператору на
          передачу данных третьему лицу для исполнения обязательств по
          гражданско‑правовому договору.
        </li>
        <li>
          <strong>8.3.</strong> В случае выявления неточностей в персональных
          данных, Пользователь может актуализировать их самостоятельно, путем
          направления Оператору уведомление на адрес электронной почты Оператора
          support@kopilka-online.ru с пометкой «Актуализация персональных
          данных».
        </li>
        <li>
          <strong>8.4.</strong> Срок обработки персональных данных определяется
          достижением целей, для которых были собраны персональные данные, если
          иной срок не предусмотрен договором или действующим законодательством.
          Пользователь может в любой момент отозвать свое согласие на обработку
          персональных данных, направив Оператору уведомление посредством
          электронной почты на электронный адрес Оператора
          support@kopilka-online.ru с пометкой «Отзыв согласия на обработку
          персональных данных».
        </li>
        <li>
          <strong>8.5.</strong> Вся информация, которая собирается сторонними
          сервисами, в том числе платежными системами, средствами связи и
          другими поставщиками услуг, хранится и обрабатывается указанными
          лицами (Операторами) в соответствии с их Пользовательским соглашением
          и Политикой конфиденциальности. Субъект персональных данных и/или с
          указанными документами. Оператор не несет ответственность за действия
          третьих лиц, в том числе указанных в настоящем пункте поставщиков
          услуг.
        </li>
        <li>
          <strong>8.6.</strong> Установленные субъектом персональных данных
          запреты на передачу (кроме предоставления доступа), а также на
          обработку или условия обработки (кроме получения доступа) персональных
          данных, разрешенных для распространения, не действуют в случаях
          обработки персональных данных в государственных, общественных и иных
          публичных интересах, определенных законодательством РФ.
        </li>
        <li>
          <strong>8.7.</strong> Оператор при обработке персональных данных
          обеспечивает конфиденциальность персональных данных.
        </li>
        <li>
          <strong>8.8.</strong> Оператор осуществляет хранение персональных
          данных в форме, позволяющей определить субъекта персональных данных,
          не дольше, чем этого требуют цели обработки персональных данных, если
          срок хранения персональных данных не установлен федеральным законом,
          договором, стороной которого, выгодоприобретателем или поручителем по
          которому является субъект персональных данных.
        </li>
        <li>
          <strong>8.9.</strong> Условием прекращения обработки персональных
          данных может являться достижение целей обработки персональных данных,
          истечение срока действия согласия субъекта персональных данных, отзыв
          согласия субъектом персональных данных или требование о прекращении
          обработки персональных данных, а также выявление неправомерной
          обработки персональных данных.
        </li>
      </ul>
    </>
  );
}
