"use client";

export default function Section09Actions() {
  return (
    <ul className="list-disc pl-5 text-[#fffffe] space-y-2">
      <li>
        <strong>9.1.</strong> Оператор осуществляет сбор, запись,
        систематизацию, накопление, хранение, уточнение (обновление, изменение),
        извлечение, использование, передачу (распространение, предоставление,
        доступ), обезличивание, блокирование, удаление и уничтожение
        персональных данных.
      </li>
      <li>
        <strong>9.2.</strong> Оператор осуществляет автоматизированную обработку
        персональных данных с получением и/или передачей полученной информации
        по информационно‑телекоммуникационных сетям или без таковой.
      </li>
    </ul>
  );
}
