"use client";

export default function Section02Concepts() {
  return (
    <ul className="list-disc pl-5 text-[#fffffe] space-y-2">
      <li>
        <strong>2.1.</strong> Автоматизированная обработка персональных данных —
        обработка персональных данных с помощью средств вычислительной техники.
      </li>
      <li>
        <strong>2.2.</strong> Блокирование персональных данных — временное
        прекращение обработки персональных данных (за исключением случаев, если
        обработка необходима для уточнения персональных данных).
      </li>
      <li>
        <strong>2.3.</strong> Веб‑сайт — совокупность графических и
        информационных материалов, а также программ для ЭВМ и баз данных,
        обеспечивающих их доступность в сети интернет по сетевому адресу
        https://kopilka-online.ru/.
      </li>
      <li>
        <strong>2.4.</strong> Информационная система персональных данных —
        совокупность содержащихся в базах данных персональных данных и
        обеспечивающих их обработку информационных технологий и технических
        средств.
      </li>
      <li>
        <strong>2.5.</strong> Обезличивание персональных данных — действия, в
        результате которых невозможно определить без использования
        дополнительной информации принадлежность персональных данных конкретному
        Пользователю или иному субъекту персональных данных.
      </li>
      <li>
        <strong>2.6.</strong> Обработка персональных данных — любое действие
        (операция) или совокупность действий (операций), совершаемых с
        использованием средств автоматизации или без использования таких средств
        с персональными данными, включая сбор, запись, систематизацию,
        накопление, хранение, уточнение (обновление, изменение), извлечение,
        использование, передачу (распространение, предоставление, доступ),
        обезличивание, блокирование, удаление, уничтожение персональных данных.
      </li>
      <li>
        <strong>2.7.</strong> Оператор — государственный орган, муниципальный
        орган, юридическое или физическое лицо, самостоятельно или совместно с
        другими лицами организующие и/или осуществляющие обработку персональных
        данных, а также определяющие цели обработки персональных данных, состав
        персональных данных, подлежащих обработке, действия (операции),
        совершаемые с персональными данными.
      </li>
      <li>
        <strong>2.8.</strong> Персональные данные — любая информация,
        относящаяся прямо или косвенно к определенному или определяемому
        Пользователю веб‑сайта https://kopilka-online.ru/.
      </li>
      <li>
        <strong>2.9.</strong> Персональные данные, разрешенные субъектом
        персональных данных для распространения, — персональные данные, доступ
        неограниченного круга лиц к которым предоставлен субъектом персональных
        данных путем дачи согласия на обработку персональных данных, разрешенных
        субъектом персональных данных для распространения в порядке,
        предусмотренном Законом о персональных данных (далее — персональные
        данные, разрешенные для распространения).
      </li>
      <li>
        <strong>2.10.</strong> Пользователь — любой посетитель веб‑сайта
        https://kopilka-online.ru/.
      </li>
      <li>
        <strong>2.11.</strong> Предоставление персональных данных — действия,
        направленные на раскрытие персональных данных определенному лицу или
        определенному кругу лиц.
      </li>
      <li>
        <strong>2.12.</strong> Распространение персональных данных — любые
        действия, направленные на раскрытие персональных данных неопределенному
        кругу лиц (передача персональных данных) или на ознакомление с
        персональными данными неограниченного круга лиц, в том числе
        обнародование персональных данных в средствах массовой информации,
        размещение в информационно‑телекоммуникационных сетях или предоставление
        доступа к персональным данным каким‑либо иным способом.
      </li>
      <li>
        <strong>2.13.</strong> Трансграничная передача персональных данных —
        передача персональных данных на территорию иностранного государства
        органу власти иностранного государства, иностранному физическому или
        иностранному юридическому лицу.
      </li>
      <li>
        <strong>2.14.</strong> Уничтожение персональных данных — любые действия,
        в результате которых персональные данные уничтожаются безвозвратно с
        невозможностью дальнейшего восстановления содержания персональных данных
        в информационной системе персональных данных и/или уничтожаются
        материальные носители персональных данных.
      </li>
    </ul>
  );
}
