"use client";

export default function Section04SubjectRights() {
  return (
    <>
      <p className="text-[#fffffe] leading-relaxed">
        <strong>4.1.</strong> Субъекты персональных данных имеют право:
      </p>
      <ul className="list-disc pl-5 text-[#fffffe] space-y-2">
        <li>
          получать информацию, касающуюся обработки его персональных данных, за
          исключением случаев, предусмотренных федеральными законами. Сведения
          предоставляются субъекту персональных данных Оператором в доступной
          форме, и в них не должны содержаться персональные данные, относящиеся
          к другим субъектам персональных данных, за исключением случаев, когда
          имеются законные основания для раскрытия таких персональных данных.
          Перечень информации и порядок ее получения установлен Законом о
          персональных данных;
        </li>
        <li>
          требовать от оператора уточнения его персональных данных, их
          блокирования или уничтожения в случае, если персональные данные
          являются неполными, устаревшими, неточными, незаконно полученными или
          не являются необходимыми для заявленной цели обработки, а также
          принимать предусмотренные законом меры по защите своих прав;
        </li>
        <li>
          выдвигать условие предварительного согласия при обработке персональных
          данных в целях продвижения на рынке товаров, работ и услуг;
        </li>
        <li>
          на отзыв согласия на обработку персональных данных, а также, на
          направление требования о прекращении обработки персональных данных;
        </li>
        <li>
          обжаловать в уполномоченный орган по защите прав субъектов
          персональных данных или в судебном порядке неправомерные действия или
          бездействие Оператора при обработке его персональных данных;
        </li>
        <li>
          на осуществление иных прав, предусмотренных законодательством РФ.
        </li>
      </ul>
      <p className="text-[#fffffe] leading-relaxed">
        <strong>4.2.</strong> Субъекты персональных данных обязаны:
      </p>
      <ul className="list-disc pl-5 text-[#fffffe] space-y-2">
        <li>предоставлять Оператору достоверные данные о себе;</li>
        <li>
          сообщать Оператору об уточнении (обновлении, изменении) своих
          персональных данных.
        </li>
      </ul>
      <p className="text-[#fffffe] leading-relaxed">
        <strong>4.3.</strong> Лица, передавшие Оператору недостоверные сведения
        о себе, либо сведения о другом субъекте персональных данных без согласия
        последнего, несут ответственность в соответствии с законодательством РФ.
      </p>
    </>
  );
}
