"use client";

export default function Section01General() {
  return (
    <>
      <p className="text-[#fffffe] leading-relaxed">
        Настоящая политика обработки персональных данных составлена в
        соответствии с требованиями Федерального закона от{" "}
        <strong>27.07.2006. № 152‑ФЗ «О персональных данных»</strong> (далее —
        Закон о персональных данных) и определяет порядок обработки персональных
        данных и меры по обеспечению безопасности персональных данных,
        предпринимаемые услуги оказываются{" "}
        <strong>Стуловым Фёдором Фёдоровичем</strong>, действующим в статусе
        самозанятого (НПД) (далее — Оператор).
      </p>
      <p className="text-[#fffffe] leading-relaxed">
        <strong>1.1.</strong> Оператор ставит своей важнейшей целью и условием
        осуществления своей деятельности соблюдение прав и свобод человека и
        гражданина при обработке его персональных данных, в том числе защиты
        прав на неприкосновенность частной жизни, личную и семейную тайну.
      </p>
      <p className="text-[#fffffe] leading-relaxed">
        <strong>1.2.</strong> Настоящая политика Оператора в отношении обработки
        персональных данных (далее — Политика) применяется ко всей информации,
        которую Оператор может получить о посетителях веб‑сайта{" "}
        <a
          className="text-[#f9bc60] hover:underline break-all"
          href="https://kopilka-online.ru/"
          target="_blank"
          rel="noopener noreferrer"
        >
          https://kopilka-online.ru/
        </a>
        .
      </p>
    </>
  );
}
