"use client";

export default function Section05Principles() {
  return (
    <ul className="list-disc pl-5 text-[#fffffe] space-y-2">
      <li>
        <strong>5.1.</strong> Обработка персональных данных осуществляется на
        законной и справедливой основе.
      </li>
      <li>
        <strong>5.2.</strong> Обработка персональных данных ограничивается
        достижением конкретных, заранее определенных и законных целей. Не
        допускается обработка персональных данных, несовместимая с целями сбора
        персональных данных.
      </li>
      <li>
        <strong>5.3.</strong> Не допускается объединение баз данных, содержащих
        персональные данные, обработка которых осуществляется в целях,
        несовместимых между собой.
      </li>
      <li>
        <strong>5.4.</strong> Обработке подлежат только персональные данные,
        которые отвечают целям их обработки.
      </li>
      <li>
        <strong>5.5.</strong> Содержание и объем обрабатываемых персональных
        данных соответствуют заявленным целям обработки. Не допускается
        избыточность обрабатываемых персональных данных по отношению к
        заявленным целям их обработки.
      </li>
      <li>
        <strong>5.6.</strong> При обработке персональных данных обеспечивается
        точность персональных данных, их достаточность, а в необходимых случаях
        и актуальность по отношению к целям обработки персональных данных.
        Оператор принимает необходимые меры и/или обеспечивает их принятие по
        удалению или уточнению неполных или неточных данных.
      </li>
      <li>
        <strong>5.7.</strong> Хранение персональных данных осуществляется в
        форме, позволяющей определить субъекта персональных данных, не дольше,
        чем этого требуют цели обработки персональных данных, если срок хранения
        персональных данных не установлен федеральным законом, договором,
        стороной которого, выгодоприобретателем или поручителем по которому
        является субъект персональных данных. Обрабатываемые персональные данные
        уничтожаются либо обезличиваются по достижении целей обработки или в
        случае утраты необходимости в достижении этих целей, если иное не
        предусмотрено федеральным законом.
      </li>
    </ul>
  );
}
