"use client";

export default function Section07Conditions() {
  return (
    <ul className="list-disc pl-5 text-[#fffffe] space-y-2">
      <li>
        <strong>7.1.</strong> Обработка персональных данных осуществляется с
        согласия субъекта персональных данных на обработку его персональных
        данных.
      </li>
      <li>
        <strong>7.2.</strong> Обработка персональных данных необходима для
        достижения целей, предусмотренных международным договором Российской
        Федерации или законом, для осуществления возложенных законодательством
        Российской Федерации на оператора функций, полномочий и обязанностей.
      </li>
      <li>
        <strong>7.3.</strong> Обработка персональных данных необходима для
        осуществления правосудия, исполнения судебного акта, акта другого органа
        или должностного лица, подлежащих исполнению в соответствии с
        законодательством Российской Федерации об исполнительном производстве.
      </li>
      <li>
        <strong>7.4.</strong> Обработка персональных данных необходима для
        исполнения договора, стороной которого либо выгодоприобретателем или
        поручителем по которому является субъект персональных данных, а также
        для заключения договора по инициативе субъекта персональных данных или
        договора, по которому субъект персональных данных будет являться
        выгодоприобретателем или поручителем.
      </li>
      <li>
        <strong>7.5.</strong> Обработка персональных данных необходима для
        осуществления прав и законных интересов оператора или третьих лиц либо
        для достижения общественно значимых целей при условии, что при этом не
        нарушаются права и свободы субъекта персональных данных.
      </li>
      <li>
        <strong>7.6.</strong> Осуществляется обработка персональных данных,
        доступ неограниченного круга лиц к которым предоставлен субъектом
        персональных данных либо по его просьбе (далее — общедоступные
        персональные данные).
      </li>
      <li>
        <strong>7.7.</strong> Осуществляется обработка персональных данных,
        подлежащих опубликованию или обязательному раскрытию в соответствии с
        федеральным законом.
      </li>
    </ul>
  );
}
