"use client";

export default function Section10CrossBorder() {
  return (
    <ul className="list-disc pl-5 text-[#fffffe] space-y-2">
      <li>
        <strong>10.1.</strong> Оператор до начала осуществления деятельности по
        трансграничной передаче персональных данных обязан уведомить
        уполномоченный орган по защите прав субъектов персональных данных о
        своем намерении осуществлять трансграничную передачу персональных данных
        (такое уведомление направляется отдельно от уведомления о намерении
        осуществлять обработку персональных данных).
      </li>
      <li>
        <strong>10.2.</strong> Оператор до подачи вышеуказанного уведомления,
        обязан получить от органов власти иностранного государства, иностранных
        физических лиц, иностранных юридических лиц, которым планируется
        трансграничная передача персональных данных, соответствующие сведения.
      </li>
    </ul>
  );
}
